{
    "events": [
        {
            "id": "1",
            "title": "ACM Inauguration and TechTalk Session on 'Recent Trends in IT' ",
            "date": "13/02/2023",
            "time": "11.00 am to 1.00 pm",
            "description":  "On the 13th of February 2023, the ACM Student Chapter was inaugurated at Pune Vidyarthi Griha’s College of Engineering & Technology and GKPIOM Pune. The Association for Computing Machinery (ACM) is a professional organisation that promotes advancements in the computing industry. The purpose of the ACM Student Chapter is to provide students with opportunities to learn, network, and grow in the field of computer science. The event began with the welcome address by Sahil Kulkarni (vice-chairperson), followed by Ganesh Pooja. The inaugural event was attended by students, faculty members, college dignitaries, and industry experts. The guest of honour was Mr. Tushar Desai, Director of Engineering at MasterCard India. The ACM Student Chapter Team, including Harsh Ekbote (Chairperson), Sahil Kulkarni (vice-chairperson), Vaishnavi Jagdale (Secretary), Tejas Khamkar (Treasurer), Chetan Wanave (Design Head), Siddhesh Kukade (Technical Head), Pavan Chate (Public Relations Head), Komal Pathare (Social Media Head), was introduced by Sahil Kulkarni (ACM Student Chapter vice-chairperson). After the inauguration, a technical talk session on recent trends in technology was conducted. Mr. Tushar Desai, director of engineering at MasterCard India, delivered the talk on the topic 'Recent Trends in Information Technology.' Mr. Desai spoke about virtual reality and augmented reality, and how these technologies are transforming various industries. He also talked about recession and how to survive in this situation. ACM faculty co-ordinator Prof. S.G.Kamble gave the vote of thanks to all attendees.",
            "attendance": "60",
            "imgLinks": [
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906537/acmAssets/image20_odwvxo.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906536/acmAssets/image34_oorjt9.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906538/acmAssets/image38_erkpil.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906538/acmAssets/image32_rafile.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906538/acmAssets/image33_tunh38.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906537/acmAssets/image31_wfaszb.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906536/acmAssets/image41_afwr3x.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906537/acmAssets/image37_jg5tc5.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906536/acmAssets/image45_f1ra9x.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906536/acmAssets/image43_jimcvb.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906536/acmAssets/image35_v7vqwg.jpg"
            ]
        },
        {
            "id": "2",
            "title": "Conference and Journal Research Paper Writing Workshop",
            "date": "10th March 2023",
            "time": "11.00am to 1.00pm",
            "description": "The ACM Student Chapter at Pune Vidyarthi Griha’s College of Engineering & Technology organized a Conference and Journal Research Paper Writing Workshop on 10th March 2023 at the college auditorium. The workshop aimed to provide valuable insights and practical guidance to students and researchers interested in publishing their research findings in conferences and journals. The event featured distinguished speakers and experts in the field who shared their knowledge and experience, making it a highly informative and enriching experience for all participants.\nThe workshop was attended by students, faculty members, college dignitaries, and industry experts. The guest speaker was Dr. Dipti Durgesh Patil, Associate Professor. Director Prof. R.G. Kaduskar felicitated the guest speaker Dr. Dipti Durgesh Patil. Prof.R.G.Kaduskar (Director At PVG’s COET & GKPIOM) addressed and encouraged the students. Dr.Prof.M.R.Tarambale (Principal at PVG’s COET & GKPIOM) addressed the students and encouraged them. Chetan Wanave (Design Head at ACM Student Chapter) hosted the session.\nThe speaker Dr.Dipti Patil provided an overview of the research paper writing process, including the significance of publishing in conferences and journals, choosing the right venue, and understanding the review process. The session delved into the essential components of a research paper, including the abstract, introduction, literature review, methodology, results, discussion, and conclusion. Participants learned how to organize their content effectively.\nThe workshop emphasized the importance of ethical research and writing. Participants were educated about plagiarism detection tools and how to avoid ethical violations. This session provided insights into choosing the right conferences and journals for paper submission based on research scope and goals.\nDr.Dipti Patil Mam answered questions from the participants, providing valuable advice and clarifications.\nSahil Kulkarni (Vice Chairperson at ACM Student Chapter) thanked the participants and speakers for their contributions.",
            "attendance": "150",
            "imgLinks": [
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907645/acmAssets/image44_hxhcya.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907648/acmAssets/image46_x8xzry.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907644/acmAssets/image22_nutrz0.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907644/acmAssets/image24_ttjlkv.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907644/acmAssets/image23_mjcvcz.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907644/acmAssets/image21_er2vck.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907643/acmAssets/image50_woojl0.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907644/acmAssets/image53_c0t9ox.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907643/acmAssets/image49_mo7cb1.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907643/acmAssets/image52_oefids.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907643/acmAssets/image51_gar0bs.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907643/acmAssets/image48_jkvsuv.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907643/acmAssets/image47_ndavii.jpg"
            ]
        },
        {
            "id": "3",
            "title": " “ClashOfCodes”:Coding Competition",
            "date": "8 May 2023",
            "time": "10.00am to 12.00pm",
            "description": "PVGCOET’s ACM Student Chapter organized the coding competition 'ClashOfCodes' on 8th May 2023, from 10:00 AM to 12:00 PM, at the department of information technology labs. The coding competition aimed to promote and recognize coding talent among students, providing an opportunity for participants to showcase their problem-solving abilities and programming skills. The competition was specifically open to second-year IT students, and participants registered for the event through a Google Form. The response was encouraging, with a total of 50 students participating.\n\nThere were 4 questions of easy, medium, and hard levels in the competition. The contest was organized on the HackerRank platform, and participants were required to solve the questions within a 2-hour timeframe. Submissions were evaluated based on the maximum score and the minimum time required to solve the problems. The judging process was fair and transparent, ensuring equal opportunities for all participants.\n\nThe top-performing participants were recognized and awarded with cash prizes and certificates. The 1st rank was awarded a cash prize of Rs.1000 and a certificate, the 2nd rank received a cash prize of Rs.500 and a certificate, and the 3rd rank was awarded Rs.250 and a certificate. Prof.Dr.S.A.Mahajan (HOD at the Department of Information Technology), Prof.S.S.Dixit, and Prof.S.G.Kamble presented the prizes to the winners.",
            "attendance": "50",
            "imgLinks": [
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908185/acmAssets/image25_kx4fex.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908183/acmAssets/image30_xjfzr8.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908182/acmAssets/image29_tcahgg.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908181/acmAssets/image28_um0kll.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908183/acmAssets/image11_c7qjad.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908183/acmAssets/image12_nvuu7u.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908181/acmAssets/image27_lmgwnr.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908181/acmAssets/image26_zzzup4.jpg"
            ]
        },
        {
            "id": "4",
            "title": "Introduction to DevOps Webinar",
            "date": " 05/08/2023",
            "time": " 11.00 am to 1.00 pm",
            "description": "The ACM Student Chapter of PVGCOET & GKPIOM organized an online webinar on the Google Meet platform for DevOps enthusiasts, which included a workshop. The purpose of this webinar was to gather the attention of young enthusiastic minds towards the seamless collaboration between software development and IT operations, fostering efficiency, automation, and continuous delivery to accelerate innovation and enhance business outcomes. The webinar commenced with a warm welcome address by Sahil Kulkarni (Vice-chairperson) and a guest introduction by Tejas Khamkar (Treasurer).\n\nThis online webinar attracted enthusiastic students from different branches and years. The guest of honour was Mr. Kedar Subhash Deo, Vice President of Group Practice Head in Tech Mahindra, bringing with him 26+ years of experience in the field of software development and IT operations.\n\nThe guest speaker began by introducing himself and sharing his journey in software development and operations. He provided a brief introduction to thirteen different buzzwords like Metaverse, Virtuality, Agility, blockchain, security, etc. He then explained aspects of software development (professional amateur) and answered questions such as what DevOps is exactly and why it should be used. Subsequently, he focused on the importance of DevOps in the Software Industry, discussing why DevOps is popular in the current era and its future.\n\nTowards the end of his talk, he gave a real-life example of the actual implementation and workflow of DevOps in Software development and Operation using his MyWebApp web application. He also discussed the growth of a DevOps Engineer in the software operations industry. Following a Q&A session, ACM Student Chapter Vice-chairperson Sahil Kulkarni expressed gratitude in the vote of thanks to the honorable guest, Mr. Kedar Subhash Deo, Vice President of Group Practice Head in Tech Mahindra, as well as to the attendees of the webinar.",
            "attendance": "50",
            "imgLinks": [
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908619/acmAssets/image13_gz7dif.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908619/acmAssets/image17_cobfx2.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908618/acmAssets/image16_wjstvb.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908618/acmAssets/image15_qszlb6.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705908619/acmAssets/image14_xtjqvq.png"
            ]
        },
        {
            "id": "5",
            "title": "Resume Building Workshop",
            "date": "25/10/2023",
            "time": "3.30 pm to 5.00 pm",
            "description": "On 25th October 2023, the ACM Student Chapter of PVGCOET & GKPIOM organized an offline workshop on resume building for young enthusiastic minds. The resume building session, conducted by Mr. Tushar Pawar, a corporate trainer, and image consultant, was a highly informative and engaging event aimed at providing valuable insights into the art of crafting effective resumes. A resume is a vital tool in a job search since it provides us with a page or two to highlight your best and most relevant abilities and attributes.\n\nThe session commenced with a warm welcome by Sushmita Chaudhari, a prominent member of the ACM Chapter, who extended greetings to all the attendees and set the stage for the informative session. Srushti Mahajan introduced Mr. Tushar Pawar, highlighting his extensive experience in corporate training and image consultancy. His background in the industry and expertise made him the ideal guide for the session. The Head of the IT Department (HOD), Dr. Surendra Mahajan, extended a warm welcome to Mr. Tushar Pawar, presenting him with a bouquet as a token of appreciation for his presence and valuable contribution to the event.\n\nThe workshop delved into the fundamental concept of what a resume is, explaining that it is a concise summary of an individual's qualifications, skills, and experiences, designed to showcase their suitability for a specific job or role. Mr. Pawar emphasized the importance of self-assessment, goal-setting, and research before embarking on resume writing. Understanding one's career goals and the industry is crucial for tailoring the resume accordingly.\n\nThe session provided numerous practical tips and tricks for writing an effective resume, including using action verbs, quantifying achievements, and tailoring the content to match the job description. A comprehensive breakdown of the crucial elements that should be included in a resume was presented, covering sections such as contact information, summary or objective, education, work experience, skills, and achievements. Mr. Pawar shared recommendations on font choices and sizes to ensure the resume's readability and professionalism. Clear and legible fonts were preferred, with the appropriate font size for different sections.",
            "attendance": "40",
            "imgLinks": [
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909001/acmAssets/image18_pibhzm.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909004/acmAssets/image5_vnhre4.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909002/acmAssets/image4_plgdya.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909002/acmAssets/image3_imwg4m.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909001/acmAssets/image19_mjllja.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909007/acmAssets/image7_nvhb8n.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909005/acmAssets/image6_djkzmd.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705907644/acmAssets/image2_na3cgj.jpg",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705906537/acmAssets/image1_g1a8ba.jpg"
            ]
        },
        {
            "id": "6",
            "title": "Talk on GSoC and Off-Campus Internships",
            "date": "January 13, 2024",
            "time": "12:00 PM - 2:00 PM",
            "guides":[
                "GSoC Guide: Siddhesh Kukade ",
                "Off-Campus Internship Guide: Rohit Bagal"
            ],
            "description": "The session on Google Summer of Code (GSoC) and Off-Campus Internships took place on January 13, 2024, from 12:00 PM to 2:00 PM. The event aimed to provide participants with insights into the GSoC program and the nuances of securing off-campus internships.\n\nVaishnavi Jagdale (Secretary) initiated the session with a warm welcome of guest speakers, emphasizing the importance of the topics at hand. Participants were introduced to the significance of GSoC and off-campus internships in shaping their careers. Siddhesh Kukade, our esteemed GSoC guide, took the virtual stage. His presentation provided a comprehensive overview of the GSoC program, outlining its structure and benefits. Siddhesh shared real-world examples and success stories, illustrating the transformative impact of GSoC on participants' careers. A lively Q&A session allowed participants to delve deeper into specific aspects of the GSoC application process.\n\nRohit Bagal, our Off-Campus Internship guide, continued the session. His presentation navigated participants through effective strategies for securing off-campus internships. Practical tips on resume building, portfolio creation, and interview preparation were shared, catering to the unique challenges of off-campus placements. The interactive session provided a platform for participants to seek personalized advice and address queries related to internship pursuits.\n\nVaishnavi summarized the key takeaways from both sessions, emphasizing the importance of proactive engagement. Expressing heartfelt gratitude to Siddhesh Kukade and Rohit Bagal for their invaluable contributions and expertise. Participants were thanked for their active involvement and encouraged to apply the insights gained in their professional journeys.",
            "attendance": "40",
            "imgLinks": [
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909509/acmAssets/image8_ecli8n.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909506/acmAssets/image42_zziazd.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909504/acmAssets/image36_h8eh6a.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909505/acmAssets/image39_m9svri.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909505/acmAssets/image40_ry8osk.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909504/acmAssets/image9_mtlkzv.png",
                "https://res.cloudinary.com/dn07sxmaf/image/upload/v1705909504/acmAssets/image10_tcdv8q.png"
            ]
        }
    ]
}